package slack;

/*
 * * * * * * * * * *
 * H H H * * * * * *
 * H H H * * * * * *
 * H H H * * * * * *
 * H H H * * * * * *
 * * * * * * * * * *
 * * * * * H H H * *
 * * * * * H H H * *
 * * * * * H H H * *
 * * * * * H H H * *
 * * * * * * * * * *
 *
 *
 * * * * * * * * * * *    //Тут одип прямоугольник накладывается на второй
 * H H H H * * * * *
 * H H H H * * * * *
 * H H H H H H * * *
 * H H H H H H * * *
 * * * H H H H * * *
 * * * H H H H * * *
 * * * * * * * * * *
 * * * * * * * * * *
 * * * * * * * * * *
 */
public class Graphics7 {
}
