package slack;

import java.util.Arrays;

/**
 * Измени знак элемента массива array на противоположный,
 * если значение этого элемента чётное.
 * Пример массива : {-1, 2, 3, -4, -5}
 */
public class TaskArr {
    public static void main(String[] args) {
        int[] array = {-1, 2, 3, -4, -5};
        System.out.println(Arrays.toString(array));
        for (int i = 0; i < array.length; i++) {
            if (array[i] % 2 == 0) {
                array[i] = array[i] * -1;
            }
        }
        System.out.println(Arrays.toString(array));
    }
}


/*
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0
* * * * * 0 0 0 0 0

4.
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .
. . . . . 0 0 0 0 0 . . . . .
. . . . 0 0 0 0 0 0 0 . . . .
. . . 0 0 0 0 0 0 0 0 0 . . .
. . . 0 0 0 0 0 0 0 0 0 . . .
. . . 0 0 0 0 0 0 0 0 0 . . .
. . . 0 0 0 0 0 0 0 0 0 . . .
. . . 0 0 0 0 0 0 0 0 0 . . .
. . . . 0 0 0 0 0 0 0 . . . .
. . . . . 0 0 0 0 0 . . . . .
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .
. . . . . . . . . . . . . . .

5.
0 0 . . . . . . . .
0 0 0 . . . . . . .
. 0 0 0 . . . . . .
. . 0 0 0 . . . . .
. . . 0 0 0 . . . .
. . . . 0 0 0 . . .
. . . . . 0 0 0 . .
. . . . . . 0 0 0 .
. . . . . . . 0 0 0
. . . . . . . . 0 0

6.
0 * * * * * * * * 0
* 0 * * * * * * 0 *
* * 0 * * * * 0 * *
* * * 0 * * 0 * * *
* * * * 0 0 * * * *
* * * * 0 0 * * * *
* * * 0 * * 0 * * *
* * 0 * * * * 0 * *
* 0 * * * * * * 0 *
0 * * * * * * * * 0

7.
* * * * * * * * * *
* H H H * * * * * *
* H H H * * * * * *
* H H H * * * * * *
* H H H * * * * * *
* * * * * * * * * *
* * * * * H H H * *
* * * * * H H H * *
* * * * * H H H * *
* * * * * H H H * *
* * * * * * * * * *

* * * * * * * * * *    //Тут одип прямоугольник накладывается на второй
* H H H H * * * * *
* H H H H * * * * *
* H H H H H H * * *
* H H H H H H * * *
* * * H H H H * * *
* * * H H H H * * *
* * * * * * * * * *
* * * * * * * * * *
* * * * * * * * * *

8.
* * * * * * * * * 0
* * * * * * * * * 0
0 0 0 0 0 0 0 0 0 0
* * * * * * * * * 0
* * * * * * * * * 0
* * * * * * * * * 0
* * * * * * * * * 0
* * * * * * * * * 0
* * * * * * * * * 0
* * * * * * * * * 0

9.
    #
   ###
  #####
 #######
#########
    |
/*
  Тут нужно обратить внимание на то, что ствол елочки должен быть строго посередине. А так же
  нужно учеть отступы, чтобы елочка была ровной.
*/
/*
10.
        0
        0  1
        0  1  2
        0  1  2  3
        0  1  2  3  4
        ====== 0  1  2  3  4  5
        0  1  2  3  4
        0  1  2  3
        0  1  2
        0  1
        0
        */