package HW8;

/**
 *  * Задача №3  (на подумать, сложная)
 *  * Я читаю студентам некий курс, состоящий из 10 занятий. Мне нужен класс, который представляет собой классный журнал. Этот журнал содержит список студентов (фамилии придумайте сами) и “клеточки” для выставления оценок (подсказка — как лучше хранить имя студента и все его оценки вместе?)
 *  * <p>
 *  * Класс должен иметь следующие возможности (реализованные как методы):
 *  * Поставить оценку любому студенту за любое занятие (по номеру занятия).
 *  * Распечатать все оценки всех студентов за одно занятие (по номеру)
 *  * Распечатать все оценки всех студентов за весь курс
 *  * Посчитать средний балл любого студента.
 */
public class Main3 {
}
